Revit 2027 API
RebarBendingDetailType.DisplayMode Property
 The display mode for the bending detail.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BendingDetailDisplayMode DisplayMode { get; }
Public ReadOnly Property DisplayMode As BendingDetailDisplayMode
	Get
public:
property BendingDetailDisplayMode DisplayMode {
	BendingDetailDisplayMode get ();
}
member DisplayMode : BendingDetailDisplayMode with get
Property Value
BendingDetailDisplayMode
See Also
Reference
RebarBendingDetailType Class
Autodesk.Revit.DB.Structure Namespace